IDENTIFICATION DIVISION.
PROGRAM-ID. ADD-TWO-NUMBERS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIRST-NUMBER PIC 99 VALUE 0.
01 SECOND-NUMBER PIC 99 VALUE 0.
01 RESULT PIC 999 VALUE 0.

PROCEDURE DIVISION.
    ACCEPT FIRST-NUMBER.
    ACCEPT SECOND-NUMBER.
    ADD FIRST-NUMBER, SECOND-NUMBER GIVING RESULT.
    DISPLAY "The result is: " RESULT.
    STOP RUN.
